In [137]:
import numpy as np
import pandas as pd
from datetime import timedelta, datetime

In [138]:
df1 = pd.read_csv('data/pew-raw.csv')
df1

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k
0,Agnostic,27,34,60,81,76,137
1,Atheist,12,27,37,52,35,70
2,Buddhist,27,21,30,34,33,58
3,Catholic,418,617,732,670,638,1116
4,Dont know/refused,15,14,15,11,10,35
5,Evangelical Prot,575,869,1064,982,881,1486
6,Hindu,1,9,7,9,11,34
7,Historically Black Prot,228,244,236,238,197,223
8,Jehovahs Witness,20,27,24,24,21,30
9,Jewish,19,19,25,25,30,95

In [139]:
df1_tidy = pd.melt(df1, id_vars='religion', var_name='income', value_name='count')
df1_tidy.head()

            religion  income  count
0           Agnostic   <$10k     27
1            Atheist   <$10k     12
2           Buddhist   <$10k     27
3           Catholic   <$10k    418
4  Dont know/refused   <$10k     15

In [140]:
df2 = pd.read_csv('data/billboard.csv', encoding='mac-latin2')
df2

,year,artist.inverted,track,time,genre,date.entered,date.peaked,x1st.week,x2nd.week,x3rd.week,...,x67th.week,x68th.week,x69th.week,x70th.week,x71st.week,x72nd.week,x73rd.week,x74th.week,x75th.week,x76th.week
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,78,63.0,49.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,15,8.0,6.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1999-10-23,2000-01-29,71,48.0,43.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,Madonna,Music,3:45,Rock,2000-08-12,2000-09-16,41,23.0,18.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),3:38,Rock,2000-08-05,2000-10-14,57,47.0,45.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
312,2000,Ghostface Killah,Cherchez LaGhost,3:04,R&B,2000-08-05,2000-08-05,98,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
313,2000,"Smith, Will",Freakin' It,3:58,Rap,2000-02-12,2000-02-12,99,99.0,99.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
314,2000,Zombie Nation,Kernkraft 400,3:30,Rock,2000-09-02,2000-09-02,99,99.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
315,2000,"Eastsidaz, The",Got Beef,3:58,Rap,2000-07-01,2000-07-01,99,99.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
316,2000,Fragma,Toca's Miracle,3:22,R&B,2000-10-28,2000-10-28,99,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [141]:
df2_tidy = pd.melt(df2, id_vars=['year', 'artist.inverted', 'track', 'time', 'genre', 'date.entered', 'date.peaked'], var_name='week', value_name='rank')
df2_tidy

,year,artist.inverted,track,time,genre,date.entered,date.peaked,week,rank
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,x1st.week,78.0
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,x1st.week,15.0
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1999-10-23,2000-01-29,x1st.week,71.0
3,2000,Madonna,Music,3:45,Rock,2000-08-12,2000-09-16,x1st.week,41.0
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),3:38,Rock,2000-08-05,2000-10-14,x1st.week,57.0
...,...,...,...,...,...,...,...,...,...
24087,2000,Ghostface Killah,Cherchez LaGhost,3:04,R&B,2000-08-05,2000-08-05,x76th.week,NaN
24088,2000,"Smith, Will",Freakin' It,3:58,Rap,2000-02-12,2000-02-12,x76th.week,NaN
24089,2000,Zombie Nation,Kernkraft 400,3:30,Rock,2000-09-02,2000-09-02,x76th.week,NaN
24090,2000,"Eastsidaz, The",Got Beef,3:58,Rap,2000-07-01,2000-07-01,x76th.week,NaN
24091,2000,Fragma,Toca's Miracle,3:22,R&B,2000-10-28,2000-10-28,x76th.week,NaN

In [142]:
df2_tidy = pd.melt(df2, id_vars=['year', 'artist.inverted', 'track', 'time', 'genre', 'date.entered', 'date.peaked'], var_name='week', value_name='rank').dropna()
df2_tidy['week'] = df2_tidy['week'].str.extract('(\d+)').astype('int')
df2_tidy['rank'] = df2_tidy['rank'].astype('int')
df2_tidy['date.entered'] = pd.to_datetime(df2_tidy['date.entered'])
df2_tidy['date.peaked'] = pd.to_datetime(df2_tidy['date.peaked'])
df2_tidy['time'] = pd.to_datetime(df2_tidy['time'], format='%M:%S')
df2_tidy

,year,artist.inverted,track,time,genre,date.entered,date.peaked,week,rank
0,2000,Destiny's Child,Independent Women Part I,1900-01-01 00:03:38,Rock,2000-09-23,2000-11-18,1,78
1,2000,Santana,"Maria, Maria",1900-01-01 00:04:18,Rock,2000-02-12,2000-04-08,1,15
2,2000,Savage Garden,I Knew I Loved You,1900-01-01 00:04:07,Rock,1999-10-23,2000-01-29,1,71
3,2000,Madonna,Music,1900-01-01 00:03:45,Rock,2000-08-12,2000-09-16,1,41
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),1900-01-01 00:03:38,Rock,2000-08-05,2000-10-14,1,57
...,...,...,...,...,...,...,...,...,...
19663,2000,Lonestar,Amazed,1900-01-01 00:04:25,Country,1999-06-05,2000-03-04,63,45
19700,2000,Creed,Higher,1900-01-01 00:05:16,Rock,1999-09-11,2000-07-22,63,50
19980,2000,Lonestar,Amazed,1900-01-01 00:04:25,Country,1999-06-05,2000-03-04,64,50
20017,2000,Creed,Higher,1900-01-01 00:05:16,Rock,1999-09-11,2000-07-22,64,50
20334,2000,Creed,Higher,1900-01-01 00:05:16,Rock,1999-09-11,2000-07-22,65,49

In [143]:
df2_tidy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5307 entries, 0 to 20334
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             5307 non-null   int64
 1   artist.inverted  5307 non-null   object
 2   track            5307 non-null   object
 3   time             5307 non-null   datetime64[ns]
 4   genre            5307 non-null   object
 5   date.entered     5307 non-null   datetime64[ns]
 6   date.peaked      5307 non-null   datetime64[ns]
 7   week             5307 non-null   int64
 8   rank             5307 non-null   int64
dtypes: datetime64[ns](3), int64(3), object(3)
memory usage: 414.6+ KB

In [144]:
# Split to 2 table
song_detail = ['year', 'artist.inverted', 'track', 'time', 'genre', 'date.entered', 'date.peaked']
df2_song = df2_tidy[song_detail].drop_duplicates()
df2_song['ID'] = np.arange(0,df2_song.shape[0])
df2_song

,year,artist.inverted,track,time,genre,date.entered,date.peaked,ID
0,2000,Destiny's Child,Independent Women Part I,1900-01-01 00:03:38,Rock,2000-09-23,2000-11-18,0
1,2000,Santana,"Maria, Maria",1900-01-01 00:04:18,Rock,2000-02-12,2000-04-08,1
2,2000,Savage Garden,I Knew I Loved You,1900-01-01 00:04:07,Rock,1999-10-23,2000-01-29,2
3,2000,Madonna,Music,1900-01-01 00:03:45,Rock,2000-08-12,2000-09-16,3
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),1900-01-01 00:03:38,Rock,2000-08-05,2000-10-14,4
...,...,...,...,...,...,...,...,...
312,2000,Ghostface Killah,Cherchez LaGhost,1900-01-01 00:03:04,R&B,2000-08-05,2000-08-05,312
313,2000,"Smith, Will",Freakin' It,1900-01-01 00:03:58,Rap,2000-02-12,2000-02-12,313
314,2000,Zombie Nation,Kernkraft 400,1900-01-01 00:03:30,Rock,2000-09-02,2000-09-02,314
315,2000,"Eastsidaz, The",Got Beef,1900-01-01 00:03:58,Rap,2000-07-01,2000-07-01,315
316,2000,Fragma,Toca's Miracle,1900-01-01 00:03:22,R&B,2000-10-28,2000-10-28,316

In [145]:
df2_tidy_id = pd.merge(df2_tidy, df_song[['track', 'ID']], on='track')
df2_rank = df2_tidy_id[['ID', 'date.entered', 'date.peaked', 'week', 'rank']]
df2_rank['date'] = df2_rank['date.entered'] + pd.to_timedelta(df2_rank['week']-1, unit='w')
df2_rank

       ID date.entered date.peaked  week  rank       date
0       0   2000-09-23  2000-11-18     1    78 2000-09-23
1       0   2000-09-23  2000-11-18     2    63 2000-09-30
2       0   2000-09-23  2000-11-18     3    49 2000-10-07
3       0   2000-09-23  2000-11-18     4    33 2000-10-14
4       0   2000-09-23  2000-11-18     5    23 2000-10-21
...   ...          ...         ...   ...   ...        ...
5327  314   2000-09-02  2000-09-02     1    99 2000-09-02
5328  314   2000-09-02  2000-09-02     2    99 2000-09-09
5329  315   2000-07-01  2000-07-01     1    99 2000-07-01
5330  315   2000-07-01  2000-07-01     2    99 2000-07-08
5331  316   2000-10-28  2000-10-28     1    99 2000-10-28

[5332 rows x 6 columns]

In [146]:
df3 = pd.read_csv('data/tb-raw.csv')
df3

  country  year   m014  m1524   m2534  m3544  m4554  m5564    m65  mu   f014
0      AD  2000    0.0    0.0     1.0    0.0      0      0    0.0 NaN    NaN
1      AE  2000    2.0    4.0     4.0    6.0      5     12   10.0 NaN    3.0
2      AF  2000   52.0  228.0   183.0  149.0    129     94   80.0 NaN   93.0
3      AG  2000    0.0    0.0     0.0    0.0      0      0    1.0 NaN    1.0
4      AL  2000    2.0   19.0    21.0   14.0     24     19   16.0 NaN    3.0
5      AM  2000    2.0  152.0   130.0  131.0     63     26   21.0 NaN    1.0
6      AN  2000    0.0    0.0     1.0    2.0      0      0    0.0 NaN    0.0
7      AO  2000  186.0  999.0  1003.0  912.0    482    312  194.0 NaN  247.0
8      AR  2000   97.0  278.0   594.0  402.0    419    368  330.0 NaN  121.0
9      AS  2000    NaN    NaN     NaN    NaN      1      1    NaN NaN    NaN

In [147]:
df3_tidy = pd.melt(df3, id_vars=['country', 'year'], var_name='sex-age', value_name='count')
df_temp = df3_tiny['sex-age'].str.extract('(\D)(\d+)(\d{2})')
df3_tidy['sex'] = df_temp[0]
df3_tidy['age_lower'] = df_temp[1]
df3_tidy['age_upper'] = df_temp[2]
df3_tidy

   country  year sex-age  count sex age_lower age_upper
0       AD  2000    m014    0.0   m         0        14
1       AE  2000    m014    2.0   m         0        14
2       AF  2000    m014   52.0   m         0        14
3       AG  2000    m014    0.0   m         0        14
4       AL  2000    m014    2.0   m         0        14
..     ...   ...     ...    ...  ..       ...       ...
85      AM  2000    f014    1.0   f         0        14
86      AN  2000    f014    0.0   f         0        14
87      AO  2000    f014  247.0   f         0        14
88      AR  2000    f014  121.0   f         0        14
89      AS  2000    f014    NaN   f         0        14

[90 rows x 7 columns]

In [148]:
df4 = pd.read_csv('data/weather-raw.csv')
df4

         id  year  month element  d1    d2    d3  d4    d5  d6  d7  d8
0   MX17004  2010      1    tmax NaN   NaN   NaN NaN   NaN NaN NaN NaN
1   MX17004  2010      1    tmin NaN   NaN   NaN NaN   NaN NaN NaN NaN
2  MX17004   2010      2    tmax NaN  27.3  24.1 NaN   NaN NaN NaN NaN
3   MX17004  2010      2    tmin NaN  14.4  14.4 NaN   NaN NaN NaN NaN
4   MX17004  2010      3    tmax NaN   NaN   NaN NaN  32.1 NaN NaN NaN
5   MX17004  2010      3    tmin NaN   NaN   NaN NaN  14.2 NaN NaN NaN
6   MX17004  2010      4    tmax NaN   NaN   NaN NaN   NaN NaN NaN NaN
7   MX17004  2010      4    tmin NaN   NaN   NaN NaN   NaN NaN NaN NaN
8   MX17004  2010      5    tmax NaN   NaN   NaN NaN   NaN NaN NaN NaN
9   MX17004  2010      5    tmin NaN   NaN   NaN NaN   NaN NaN NaN NaN

In [149]:
df4_tidy = pd.melt(df4, id_vars=['id', 'year', 'month', 'element'], var_name='day', value_name='temp').dropna()
df4_tidy['day'] = df4_tidy['day'].str.extract('\D(\d?)').astype('int')
def convert_time(row):
    return datetime(year=2010, month=row['month'], day=row['day'])
df4_tidy['time'] = df4_tidy.apply(lambda row: convert_time(row), axis=1)
df4_tidy = df4_tidy.pivot_table(index=['id', 'year', 'month', 'day', 'time'], columns='element', values='temp').reset_index()
df4_tidy = df4_tidy.groupby('time').aggregate('mean').reset_index().rename_axis(None, axis=1)
df4_tidy

        time  year  month  day  tmax  tmin
0 2010-02-02  2010      2    2  27.3  14.4
1 2010-02-03  2010      2    3  24.1  14.4
2 2010-03-05  2010      3    5  32.1  14.2

In [150]:
df4_tidy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   time    3 non-null      datetime64[ns]
 1   year    3 non-null      int64
 2   month   3 non-null      int64
 3   day     3 non-null      int64
 4   tmax    3 non-null      float64
 5   tmin    3 non-null      float64
dtypes: datetime64[ns](1), float64(2), int64(3)
memory usage: 272.0 bytes